#include "ObjMgt.h"

/*************************************************************************
功能：增加单个对象
输入：
key1  外部关键字 KEY1
key2  外部关键字KEY2
key3  外部关键字KEY3
输出：无
返回：
      -1 :失败(对象已经存在或者其它异常)
       0 :成功
***************************************************************************/
int AddObject (unsigned int key1, unsigned int key2, unsigned int key3) {
    /*请实现*/
    return 0;
}

/********************************************************************************
功能：删除一个或多个对象
输入：
      key1 外部关键字 KEY1
      key2 外部关键字 KEY2
      key3 外部关键字 KEY3
输出：无
返回：无

说明：用例保证参数取值为合法值和通配符0xFFFFFFFF, 通配符表示0~65535范围内的任意值;
      举例:key1=1,key2=2,key3= 0xFFFFFFFF，表示删除key1=1,key2=2的所有对象;
           key1,key2,key3取值全为0xFFFFFFFF时,表示删除所有对象。
*********************************************************************************/
void DeleteObject (unsigned int key1, unsigned int key2, unsigned int key3) {
    /*请实现*/
    return ;
}

/********************************************************************************
功能：查询单个对象是否存在
输入：
      key1 外部关键字 KEY1
      key2 外部关键字 KEY2
      key3 外部关键字 KEY3
输出：无
返回：
      0：不存在
      1：存在
**********************************************************************************/
int IsObjectExist (unsigned int key1, unsigned int key2, unsigned int key3) {
    /*请实现*/
    return 0;
}

/******************************************************************************************************
Description     清空所有对象
Prototype       void Clear();
Input Param     无
Output Param    无
Return Value    无

********************************************************************************************************/
void Clear(void) {
    /*在这里实现功能*/
    return;
}
